Autodesk.Navisworks.Api.ModelItem.IsHidden
Is this item hidden (won't be displayed in viewing window)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItem.IsRequired
Is this item required (will always display in viewing window, won't drop out)
Throws System.ObjectDisposedException:
Object has been Disposed